{
    "blogPosts": [
        {
            "id": 5,
            "blogTitle": "Test post",
            "coverPhotoName": "remotelylogo.png",
            "coverPhotoURL": "https:\/\/vue-blog-app.s3.eu-central-1.amazonaws.com\/coverPhotos\/remotelylogo.png",
            "blogHTML": "<p>Test post<\/p>",
            "created_at": "2022-09-15T07:41:25.000000Z",
            "updated_at": "2022-09-15T07:41:25.000000Z"
        },
        {
            "id": 4,
            "blogTitle": "Importance of community as a Web developer",
            "coverPhotoName": "community.jpg",
            "coverPhotoURL": "https:\/\/vue-blog-app.s3.eu-central-1.amazonaws.com\/coverPhotos\/community.jpg",
            "blogHTML": "<h1><u>Importance of community as a Web developer<\/u><\/h1><p>\tHistorically, I don’t work well with people. Boarding school brings out this sole survival at all cost mentality in you or maybe it’s just me. So the beginning of my journey as a web developer was hard. I had my two best friends coding at the time, Syd was learning C# while Harith was learning Javascript. I just focused on school stuff. I later got bored and started learning Python on Sololearn. It was fun but I didn’t really learn anything because I was just skimming through the tutorial. After High School I picked up HTML and CSS then I started to learn PHP.&nbsp;<\/p><p><br><\/p><h1><br><\/h1>",
            "created_at": "2022-09-15T07:38:10.000000Z",
            "updated_at": "2022-09-15T07:38:10.000000Z"
        },
        {
            "id": 3,
            "blogTitle": "Using Golang for the first time as a PHP fanatic",
            "coverPhotoName": "golang (1).png",
            "coverPhotoURL": "https:\/\/vue-blog-app.s3.eu-central-1.amazonaws.com\/coverPhotos\/golang%20%281%29.png",
            "blogHTML": "<h1><u>Using Golang for the first time as a PHP Fanatic<\/u><\/h1><p>\tI don’t really experiment with languages. I started learning PHP in 2019 and stuck with it. I saw other languages but as long as they didn’t offer any significant improvement over my PHP I didn’t pay attention. Although, I learnt Javascript and Typescript because of my web development(they offered what my PHP couldn’t).&nbsp;<\/p><p>\tThen this year I started sneaking to go.dev to just look at the features. You know how you stare at the really expensive watches at the mall but never enter the store. That kind of thing. Then I watched a youtube video of Nuno Maduro(laravel core team member) describing his inspiration for making Laravel-zero. Laravel-zero is a micro-framework for building cli based applications with php. After watching the video, I researched on building CLI applications and everywhere was ‘Cobra, Cobra!’. Cobra is a cli framework based on Golang. Then I purchased and read the book ‘Building Powerful Console based applications with Go’. The language is really cool. Clean syntax and ease just like my php. In my opinion, programming syntax should be simple. Also it comes with testing features built in which is nice.&nbsp;<\/p><p>\tI lost interest in making CLI applications but I still tilt my cap to Go’s ease of use and clean code.<\/p><p><br><\/p>",
            "created_at": "2022-09-15T07:33:31.000000Z",
            "updated_at": "2022-09-15T07:33:31.000000Z"
        },
        {
            "id": 2,
            "blogTitle": "PHPStorm vs VScode for web development",
            "coverPhotoName": "phpvscode.jpg",
            "coverPhotoURL": "https:\/\/vue-blog-app.s3.eu-central-1.amazonaws.com\/coverPhotos\/phpvscode.jpg",
            "blogHTML": "<h1><u>Php vs VSCode for web development<\/u><\/h1><p>Like every other young programmer out there I started serious coding with VScode. I used notepad++ for a short time then Eclipse when I tried Java and gave up in two weeks. But it gets to a point where you find one IDE that just works for you and you stick with it. Since we spend so much time coding, there is a need to code with something you like looking at. VSCode actually gets the job done, also it has a lot of extensions if you want to increase its functionality. Then I joined the laravel community and caught the first glimpse of PHPstorm on code snippets from twitter and on youtube tutorials. It was gorgeous. I especially liked the hinting to tell you what argument goes in the function.<\/p><p><br><\/p><p><img src=\"https:\/\/vue-blog-app.s3.eu-central-1.amazonaws.com\/postImages\/Screenshot%20%28112%29.png363453\" width=\"708\" height=\"141.0822669104205\" style=\"display: block; margin: auto;\" data-align=\"center\"><\/p><p><br><\/p><p>It is a small aesthetic addition, but one of my favorite features of phpstorm. It also has really nice shortcuts, Click on the shift key twice to search for any file in your project. F4 to jump to source definition(VScode has f12 but my left hand is my dominant hand on the keyboard :)).<\/p><p>I know you can customize VScode shortcuts but I am lazy and use features the IDE gives out of the box.<\/p><p><br><\/p><p>PHPstorm has some defects though. It is marketed as Webstorm(Jetbrain’s official Javascript IDE) + PHp support, but it doesn’t understand my Pinia stores when I use Vue. Apart from that it does the rest of my Vue very well. But maybe I am being too harsh because I use the Volar extension on VScode and have no extensions on my Phpstorm.<\/p><p><br><\/p><p>I forgot to add that PHPstorm is paid, but thankfully Jetbrains gives students a free use plan. I actually don’t mind paying when I am done with school because it is such a cool IDE to use. In the end I still use both IDE’s. When my eyes get tired of the phpstorm look, I switch to vscode and vice versa. It doesn’t matter as long as you write good code right😏.&nbsp;<\/p><p><br><\/p>",
            "created_at": "2022-09-15T07:27:22.000000Z",
            "updated_at": "2022-09-15T07:27:22.000000Z"
        }
    ]
}